In [29]:
import pandas as pd
import numpy as np
import random
import string
np.random.seed(56)

In [24]:
pd.DataFrame({"A":[1,2], "B":[3,4], "C":[5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [22]:
pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], index=range(1,5), columns=["A","B","C"])

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [23]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [30]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  85  15  64
1  34  14  87

In [33]:
def id ():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [36]:
id()

'nzqWI'

In [41]:
def score():
    return np.random.randint(0, 100)

In [42]:
score()

22

In [68]:
pd.DataFrame([[score(), score(), score(), score()],[score(), score(), score(), score()],[score(), score(), score(), score()],[score(), score(), score(), score()],[score(), score(), score(), score()]], index=[id(),id(),id(),id(),id()], 
             columns=["국어", "영어", "수학", "사회"])

       국어  영어  수학  사회
CaILx  44  32   8  29
MbjMR  94  78  79  96
OZAkK  62  17  75  49
qnJMU  93  44  14  94
cKUki  25  54  29  10

In [87]:
pd.DataFrame({"국어":[score() for i in range(10)], "영어":[score() for i in range(10)], 
              "수학":[score() for i in range(10)], "사회":[score() for i in range(10)]}, 
             index=[id() for i in range(10)])

       국어  영어  수학  사회
WSLzD  22  64  34  26
uGrzd  51  19  95  89
evYkA  43   4   6  48
RCQro  43  61  37  42
aFEKe  41   5  50  96
jLRAt  57   7  59  76
CqdRs  71  18  16  73
CASMf   3  42   5  32
wMIiE  15  84  19  11
kojHs  86  72  51  30